In [1]:
# Load pandas
import pandas as pd

# Read in dataset
trends = pd.read_csv("datasets/trends_kj_sisters.csv")

# Inspect data
trends.head()

,Month,Kim Kardashian: (Worldwide),Khloé Kardashian: (Worldwide),Kourtney Kardashian: (Worldwide),Kendall Jenner: (Worldwide),Kylie Jenner: (Worldwide)
0,2007-01,2,<1,<1,<1,2
1,2007-02,12,<1,<1,<1,2
2,2007-03,9,<1,<1,<1,1
3,2007-04,6,<1,<1,<1,1
4,2007-05,6,<1,<1,<1,2

In [2]:
# Make column names easier to work with
trends.columns = ['month','kim','khloe','kourtney','kendall','kylie']

# Inspect data
trends.head()

     month  kim khloe kourtney kendall  kylie
0  2007-01    2    <1       <1      <1      2
1  2007-02   12    <1       <1      <1      2
2  2007-03    9    <1       <1      <1      1
3  2007-04    6    <1       <1      <1      1
4  2007-05    6    <1       <1      <1      2